# ============================================================
# 01b: اطبع عدداً صحيحاً — Print Integer
# ============================================================
#
# ✨ syscall 1 تطبع أي رقم في $a0
#    مثل cout << number;
# ============================================================

.data
    msg: .asciiz "The number is: "

.text
main:
    la $a0, msg
    li $v0, 4
    syscall

    li $a0, 255        # الرقم اللي بنطبع
    li $v0, 1          # syscall 1 = اطبع عدداً
    syscall            # يظهر: 255

    li $v0, 10
    syscall
