# ============================================================
# 02c: جمع 3 أرقام — Add Three Numbers
# ============================================================
#
# ✨ نجمع 3 أرقام: a + b + c
#    نستخدم ADD مرتين
# ============================================================

.data
    msg: .asciiz "10 + 20 + 30 = "

.text
main:
    li $t0, 10
    li $t1, 20
    li $t2, 30

    add $t3, $t0, $t1      # t3 = 10 + 20 = 30
    add $t4, $t3, $t2       # t4 = 30 + 30 = 60

    la $a0, msg
    li $v0, 4
    syscall

    move $a0, $t4
    li $v0, 1
    syscall                # يظهر: 60

    li $v0, 10
    syscall
